artillery.yaml
config:
  target: 'http://localhost:4000'
  phases:
    - name: Warm up
      arrivalRate: 5
      duration: 60
    - name: Ramp up load
      duration: 120
      arrivalRate: 5
      rampTo: 50
    - name: Sustained load
      duration: 300
      arrivalRate: 50
  plugins:
    expect: {}

scenarios:
  - name: 'Board testing'
    flow:
      - post:
          url: '/login'
          json:
            login: 'admin'
            password: 'admin'
          capture:
            - json: $.token
            - as: TOKEN
      - get:
          url: '/boards'
          headers:
            authorization: 'Bearer {{ TOKEN }}'
          expect:
            - statusCode: 200
            - contentType: json
      - post:
          url: '/boards'
          headers:
            authorization: 'Bearer {{ TOKEN }}'
          json:
            title: 'Load test board {{ $randomString() }}'
            columns: '[]'
          capture:
            - json: '$.id'
              as: 'BOARD_ID'
          expect:
            - statusCode: 201
            - contentType: json
      - think: 5
      - get:
          url: 'boards/{{ BOARD_ID }}'
          headers:
            authorization: 'Bearer {{ TOKEN }}'
          expect:
            - statusCode: 200
            - contentType: json
      - put:
          url: 'boards/{{ BOARD_ID }}'
          headers:
            authorization: 'Bearer {{ TOKEN }}'
          json:
            title: 'Updated load test board'
          expect:
            - statusCode: 201
            - contentType: json
            - hasProperty: title
            - equals:
                - 'Updated load test board'
      - think: 5
      - delete:
          url: 'boards/{{ BOARD_ID }}'
          headers:
            authorization: 'Bearer {{ TOKEN }}'
          expect:
            - statusCode: 204